{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<p>After 10 years working as a professional software engineer, I enrolled in\nGeorgia Tech's <a href=\"www.omscs.gatech.edu/\">Online Master's in Computer Science</a>. I was motivated by the large\ngaps in my knowledge that I was not able to fill by self study despite numerous\nattempts. While I earned an undergrad degree in Computer Science, I have never\nwritten a compiler, dug in depth into operating systems concepts, gone beyond\nintro to algorithms, or delved into AI/ML/RL at all. A CS grad from MIT very\nwell graduates with all those skills but I went to a middling university and got\nwell, middling grades. After 10 years in the field I am a Hell of a lot more\nmotivated and also much more genuinely interested in the subject than I was at\nage 20 when I just enrolled into intro to CS because I couldn't get into an\nEconometrics class.</p>\n<p>I am four classes into OMSCS program and I have to tell you that on the whole it\nis fucking amazing. The classes are hard, my classmates are super engaged and\nhelpful, and I am learning a lot. Did I mention that the program is cheap? Only\n$180/credit hour which adds up to only $8,000 USD for the entire degree. That\nlow price means that the OMSCS can attract very smart people from all over the\nworld who can't take out student loans or don't have the means to drop $21K on a\ngraduate degree. That low price also means that Georgia Tech is serious about\nattracting the best students not just those that can pay.</p>\n<p>I am surprised that the OMSCS program 1) doesn't get more attention and 2) isn't\ncopied by more institutions. I suspect that the program doesn't get more attention because it is really\ndamn hard and most aspirants to a software engineering career are looking for an\neasier way into the field than a 3 year long 20 hour a week slog. If you're lucky like\nme and can do the program full-time, you're looking at 40+ hrs/week for 2\nyears. Fuck that, just spend $15k on a six month programming bootcamp and\nI am sure you will get that FAANG job of your dreams! Sorry friends, it doesn't\nwork that way.</p>\n<p>It is worth mentioning that there are broadly two groups of students I have met\nin the program. The first group are those that are looking to generally upgrade\ntheir skills. These people often but not always choose the Computing Systems\nspecialization. This group doesn't have to get this degree to make the next\ncareer step. The second group are those that are here for AI/ML. These people\nare very smart, dedicated, and generally need this degree to get a job in the\nAI/ML field. Most undergrad programs don't offer AI/ML so this often a student's\nfirst academic exposure to the topic.</p>\n<p>I will break down my experience so far into the proverbial good, bad, and ugly. </p>\n<h2>The Good</h2>\n<ul>\n<li>My classmates are dedicated, smart, and genuinely interested in the topic. In\none course, I learned a signicant amount about the topic from a classmate who\nis a hardware engineer with direct experience in areas related to the course\nwe were taking together.</li>\n<li>Many classes are taught by dedicated professors and TAs who pay close\nattention to your experience and provide useful and quick feedback.</li>\n<li>Some courses have amazing lectures and engaging projects.</li>\n<li>More courses are steadily being added. Starting next term we will be able to\ntake data science courses such as Bayesian Statistics and Time Series Analysis\nas electives. A course in Applied Cryptography should become available some\ntime in 2020.</li>\n<li>The class discussions we have on Slack are awesome. Further, the community is\nvery supportive. Some of my classes have alumni channels that are very active\nand keep people connected.</li>\n</ul>\n<h2>The Bad</h2>\n<ul>\n<li>The content of some courses is out of date and in need of a reboot.</li>\n<li>Some courses limp along on a skeleton crew of TAs and the professor responsible\nthe course is only minimally involved.</li>\n<li>Dealing w/ the Georgia Tech bureaucracy can be time-consuming. I typically\nonly have to deal with the bureaucracy during registration thankfully.</li>\n<li>The application process was time-consuming BUT I they did let me in and they\ndidn't require me to take the GRE.</li>\n<li>No distributed system course is offered nor is there a plan to offer one. This\nis a big deal for me personally as it is my professional area of interest.</li>\n</ul>\n<h2>Ugly</h2>\n<ul>\n<li>There are some courses of low quality and poor execution. Rather than call\nthem out, I direct you to look at the course reviews at\n<a href=\"https://omscentral.com/courses\">omscentral.com</a>.</li>\n<li>I doubt that prospective employers will be overly impressed by this\ndegree. They seem to only care about LEETCODE algorithm questions. To pass\nthose interviews you might be better off spending a year on codewars. If you\naren't interested to acquire the knowledge that this program offers, you are\nwasting your time and money.</li>\n</ul>\n<h2>Courses I have taken:</h2>\n<ul>\n<li>High Performance Computer Architecture (HPCA) - This class started where the\nComputer Architecture class I took in undergrad left off. Professor wasn't\nespecially active but his lectures were awesome and the exams were challenging\nin the best possible way. I got an intuitive sense of how Cache Coherence, CPU\npipelining, Tomasulo's Algorithm, etc. work. Our tireless TA, Nolan, did a\ngreat job.</li>\n<li>Graduate Introduction to Operating Systems (GIOS) - Super-involved professor, amazing TAs, best run\ncourse I have taken. I dug into GLibc and kernel source code and up to my neck into how KVM works.\nFor the first time in my life, I started feeling comfortable working in C code.</li>\n<li>Machine Language for Trading (ML4T) - A class w/ great lectures and great\nTAs. The originating professor has moved on some years ago to Morgan Stanley\nand likely a much higher salary. I learned equal parts about finance and the\nbasics of data science. It was a gentle and enjoyable introduction to Machine\nLearning.</li>\n<li>Advanced Operating Systems (AOS) - This class is amazing and hard as fuck. I\nspend 20-30 hours a week on it. I am still in the middle of it. GIOS helped me understand Linux but AOS has taken me way past it to get a grip on microkernels, exokernel, lightweight RPC, and more. Just the other day Google put out a paper on its <a href=\"https://ai.google/research/pubs/pub48630/\">Snap framework</a> and its citations read like AOS's reading list. Just half of AOS prepared me well for understanding Snap and the challenges it is trying to address. The exams in this class are ridiculously difficult.</li>\n</ul>\n<p>Next term I plan on taking Compilers and a data science course.</p>\n<p>As I noted in the introduction, I am surprised by how little competition the\nOMSCS has attracted. Here are some notes on the programs that I considered\nbefore settling on the OMSCS. I do find it unfortunate that while some other\nprestigious institutions offer online MS in CS, they generally do not compare in\nterms of breadth nor cost.</p>\n<p>University of Illinois started an online MS in CS in 2019. U of I charges shocking $670/credit hour thus a <a href=\"https://cs.illinois.edu/academics/graduate/professional-mcs-program/online-master-computer-science#TuitionFees\">whopping total of $21,000</a> for their M.S degree. in C.S. when they do not even offer critical courses such as AI, ML, compilers, Graduate Algorithms, etc. That $21k price tag tells me they are treating the program as a cash cow, not as a real opportunity to reach out to a large swath of students.</p>\n<p>I have heard good things about <a href=\"https://www.cs.utexas.edu/graduate-program/masters-program/online-option#academics\">U Texas MS in C.S.</a>, specifically that they are serious about AI education. Unlike Georgia Tech, Texas offers a Deep Learning course. Further, Texas only charges $333 per credit hour. That's almost double what Georgia Tech charges ($180/credit hour) but still reasonable. Sadly, Texas only currently offers four courses per term. Texas just started this program in 2019 so it will take some time to mature. Here is to hoping they provide Georgia Tech with some much needed competition.</p>\n<p><a href=\"https://asuonline.asu.edu/online-degree-programs/graduate/computer-science-mcs/\">Arizona State</a> offers an impressive set of courses but I have no information on their quality. At $500/credit hour it is a good bit pricier than Georgia Tech or Texas but not as exorbitant as University of Illinois. My personal suspicion is that any university that charges significantly more than Georgia Tech is seeking students who just want the credential at minimal effort. That said, your diploma from Arizona State or University of Illinois will not specify that you earned your M.S. in Computer Science remotely. Like Texas and Illinois, Arizona State's Master's in C.S. started very recently so it has some growing to do.</p>\n<h2>Conclusion</h2>\n<p>I have really enjoyed the OMSCS thus far and if you are willing to put in the work, you will too.</p>","id":"6cb56d24-6008-540a-8f62-58b110fd491c","excerpt":"After 10 years working as a professional software engineer, I enrolled in\nGeorgia Tech's  Online Master's in Computer Science . I was…","frontmatter":{"path":"/blog/y-u-no-omscs","date":"29 October, 2019","title":"Why Isn't Georgia Tech's Online MS in Computer Science More Popular?","tags":"blog"}}},{"node":{"html":"<p>Bryan talks with <a href=\"https://twitter.com/vanilizer\">Agnieszka Sarnecka</a> about <a href=\"https://neufund.org\">Neufund</a>.</p>\n<iframe style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/7653899/height/90/theme/custom/autoplay/no/autonext/no/thumbnail/yes/preload/no/no_addthis/no/direction/backward/render-playlist/no/custom-color/87A93A/\" height=\"90\" width=\"100%\" scrolling=\"no\"  allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen></iframe>\n<p>Links</p>\n<ul>\n<li>Aga's excellent <a href=\"https://medium.com/@agnieszkasa\">Medium articles</a></li>\n<li><a href=\"https://termsheet.ninja/\">Termsheet Ninja</a></li>\n<li>Neufund's first <a href=\"https://blog.neufund.org/first-ever-public-offering-of-equity-on-blockchain-86d8e27c477f\">ETO</a></li>\n<li>Neufund's <a href=\"https://etherscan.io/address/0x98b2d718d96f956d1cdeda013cfd67a797928b13#code\">Identity Registry smart contract</a> that enforces KYC for ETOs</li>\n<li><a href=\"https://www.ccmalta.com/news/malta-blockchain-crypto-legislation\">Crypto legislation in Malta</a></li>\n<li><a href=\"https://blog.neufund.org/good-protocols-how-to-properly-standardize-security-tokens-95ff83c81c4a\">How to Properly Standardize Security Tokens</a> from Neufund's CTO</li>\n<li><a href=\"https://github.com/neufund\">Neufund's Github repositories</a></li>\n<li><a href=\"https://github.com/ethereum/EIPs/issues/725\">ERC725</a> and <a href=\"https://github.com/ethereum/EIPs/issues/735\">ERC735</a></li>\n</ul>","id":"699f481a-31ba-58b5-826c-07c489826c76","excerpt":"Bryan talks with  Agnieszka Sarnecka  about  Neufund . Links Aga's excellent  Medium articles Termsheet Ninja Neufund's first  ETO Neufund's…","frontmatter":{"path":"/podcast/neufund-with-aga","date":"06 November, 2018","title":"Episode 3 - Neufund with Agnieszka Sarnecka","tags":"podcast"}}},{"node":{"html":"<p>Bryan talks with <a href=\"https://twitter.com/stephanlivera\">Stephan Livera</a> about Bitcoin, banking, and Austrian economics. Stephan is the host of a most excellent and eponymously named <a href=\"https://stephanlivera.com\">podcast</a>.</p>\n<iframe style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/7112178/height/90/theme/custom/autoplay/no/autonext/no/thumbnail/yes/preload/no/no_addthis/no/direction/backward/render-playlist/no/custom-color/87A93A/\" height=\"90\" width=\"100%\" scrolling=\"no\"  allowfullscreen webkitallowfullscreen mozallowfu\nllscreen oallowfullscreen msallowfullscreen></iframe>\n<h3>Links</h3>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Karl_Menger\">Karl Menger</a> - founder of Austrian economics</li>\n<li><a href=\"https://mises.org\">Mises Institute</a></li>\n<li>Jesus de Huerta de Jesus, <a href=\"https://mises.org/sites/default/files/Money_Bank_Credit_and_Economic_Cycles_De%20Soto.pdf\">Money, Bank Credit, and Economic Cycle</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Murray_Rothbard\">Murray Rothbard</a></li>\n<li>Stephan's interview with <a href=\"https://stephanlivera.com/2018/09/20/slp23-economic-eras-of-bitcoin-and-lightning-development-with-rusty-russell-of-blockstream/\">Rusty Russell</a></li>\n<li>Stephan's interview with <a href=\"https://stephanlivera.com/2018/08/05/slp7-earning-interest-on-bitcoins-lightning-network-with-nik-bhatia/\">Nik Bhatia</a></li>\n</ul>\n<h3>Legit or Quit</h3>\n<ol>\n<li>Fractional Reserve Banking - QUIT</li>\n<li>Ethereum - QUIT</li>\n<li>The Free Banking movement led by Larry White and George Selgin - QUIT</li>\n<li>Murray Rothbard - LEGIT</li>\n</ol>","id":"7f669abc-ca69-5688-8835-6bcbaeda2c79","excerpt":"Bryan talks with  Stephan Livera  about Bitcoin, banking, and Austrian economics. Stephan is the host of a most excellent and eponymously…","frontmatter":{"path":"/podcast/stephan-livera-explains-it-all","date":"01 October, 2018","title":"Episode 2 - Stephan Livera","tags":"podcast"}}},{"node":{"html":"<p>There is a plethora of blogs, podcasts, books, and Internet flotsam that you can consume to learn about Bitcoin. If you are new to this space, you should start with <a href=\"https://www.wiley.com/en-us/The+Bitcoin+Standard%3A+The+Decentralized+Alternative+to+Central+Banking-p-9781119473862\">The Bitcoin Standard</a> by Saifedean Ammous. If you are already familiar, you should still drop what you are doing and read it immediately. I had high expectations for this book and despite some significant flaws it exceeded them. Please note that I listened to this book in audio form and did not read the printed version.</p>\n<img src=\"https://media.wiley.com/product_data/coverImage300/61/11194738/1119473861.jpg\" id=\"bitcoinstanard\" alt=\"The Bitcoin Standard\" style=\"float: right; margin-left: 10px; margin-right: 10px; margin-top: 10px;\" />\n<p>One surprising aspect of this book is that a minority of it is spent discussing Bitcoin and blockchain. The majority is spent on financial history of the world with special focus on the Gold Standard, modern financial catastrophies and their causes, and the relatively recent end of the Gold Standard. I am fuzzy on actual page counts as I listened to the audiobook version but if you are impatient to learn about Bitcoin you might get frustrated by the amount of financial history. I very much enjoyed it. If you haven't also read Jack Weatherford's <a href=\"https://www.goodreads.com/book/show/103226.The_History_of_Money\">History of Money</a> I highly, highly recommend it.</p>\n<p>Saifedean spends a lot of time dwelling on what constitutes <a href=\"https://financial-dictionary.thefreedictionary.com/Sound+Money\">sound money</a> and what is <em>unsound money</em>. Essentially, unsound money is money that is not backed by a tangible commodity that will retain its value. Unsound money loses value over time. The U.S. dollar, according to Saifedean, is unsound money as it loses value every year due to planned (and unplanned!) inflation. A lot of people don't understand that governments can literally print money to pay their debts and the U.S. actually does that. Further, banks (registered depository institutions) have the power to create money out of thin air every time they make a new loan as long they respect the <a href=\"https://www.investopedia.com/ask/answers/111414/how-do-leverage-ratios-help-regulate-how-much-banks-lend-or-invest.asp\">leverage ratio</a> mandated by banking regulators. This creation of money by bank loans can lead to credit bubbles like the one we saw in 2008.</p>\n<p>Unsound money, according to Saifedean, is the cause of many and perhaps most of the ills of our modern world. He goes a bit too far here in my opinion but he makes a compelling case that going off the gold standard allowed the countries of Europe to finance wars of scale not seen before the 20th century. Wait, how does that work? Basically, every country that participates in a modern war suspends redemption of their national currency for gold and then proceeds to print as much of their own coinage as needed to pay for the war effort. </p>\n<p>So here is my ridiculous, mostly wrong abbreviation of world monetary history</p>\n<ol>\n<li>Scarce commodities are used as the medium of financial exchange - sea shells, glass beads, giant rocks</li>\n<li>Gold and silver are used</li>\n<li>The world consolidates on gold and drops silver </li>\n<li>Governments create national currencies backed by gold (The Gold Standard)</li>\n<li>Governments create a system of fixed exchange rates where the US Dollar is the world's reserve currency and only the US dollar is backed by gold (Bretton Woods)</li>\n<li>The U.S. drops the Gold standard, Bretton Woods disintegrates, and all currencies are traded according to floating exchange rates</li>\n</ol>\n<p>It is critical to note in steps 5 and 6, use of national currencies was\nmandatory and exclusive. You couldn't use dollar to buy a coffee in Europe nor\nthe English pound to pay your rent in America.</p>\n<p>Saifedean believes in the next step Bitcoin will replace the dollar as the world's reserve currency. What does that even mean? It means that:</p>\n<ul>\n<li>All national currencies are valued in terms of Bitcoin</li>\n<li>Banks will use to Bitcoin to settle with each other</li>\n<li>Critical commodities like oil will be traded in Bitcoin</li>\n</ul>\n<p>As an interesting I want to mention Saifedean's thoughts on 'unsound food'.\nSaifedean also makes a fascinating argument that unsound money has led to\nunsound food. According to Saifedean, the US government used its power to print\nmoney to create agriculture subsidies that produced a global glut of soybeans\nand corn that arguably has created the world's obesity epidemic. That glut\ninspired tasty new processed food products that have made Americans ridiculously\nfucking fat. Sadly the trend has spread to the rest of the world. I have\noverstated the cause here, there are several causes but key ones are high\nfructose corn syrup and junk food made out of soybeans and corn. This argument\nis a bit of a stretch to say that unsound money caused it since the U.S. could\nhave done the same under the gold standard it just would have been a lot more\nexpensive and less likely to have been implemented. But back to more important points.</p>\n<img src='https://fee.org/media/23293/shutterstock_227051371_mini.jpg?anchor=center&mode=crop&width=1920&rnd=131444222820000000' width=414px height=310px style=\"margin-left: 10px; margin-right: 10px; margin-top: 10px; float: right;\"/>\n<h2>Lemme tell ya, The Gold Standard was awesome</h2>\n<p>The days of the global Gold Standard was fucking incredible, at least as\nSaifedean describes it. Wars were limited in scope because of governments\ncouldn't print endless amounts of money to pay for them w/ out leaving it. If a\ncountry did take their currency off the Gold Standard, citizens would quickly\nswitch to a one that was backed by gold, causing the rapid devaluation of the\nnational currency. International trade was painless as currencies didn't fluctuate like they do\ntoday. So if this system was so great, why does no nation currently use the Gold Standard?</p>\n<p>Well, as noted earlier governments naturally wish to print money to fund short-term interests\nat the expense of the long-term health of the national currency. An economist emerged\nin the 20th century whose popular theories gave national governments the intellectual\nbasis to drop the gold standard and move to pure fiat money, i.e. money not backed by\nany tangible asset. That economist was John Maynard Keynes.</p>\n<p>Keynes believed that governments should print money at will to stimulate the\neconomy. As you can imagine, he was not a fan of the Gold Standard as it\ninhibits a government's ability to print money. Keynes ideas really took hold when\nAmerican President Franklin Delano Roosevelt followed his policy prescriptions to\naddress America's Great Depression. Keynes explanation for the causes of the\nGreat Depression are now the dominant explanation taught in economics courses such\nas the one I took at university. Keynes' economic priniciples gradually came to dominate such\nthat even the leader of the more conservative wing of economists, Milton Friedman,\nfamously said \"We're all Keynesians now.\"</p>\n<p>To be clear the dominant explanation for the cause of America's Great Depression\nis that of the Monetarists, led by Dr. Friedman, which is that the U.S. entered\na cyclical recession that turned into a depression when the Federal Reserve failed to expand the money supply sufficiently to address liquidity crisis causes by bank runs.</p>\n<div style=\"margin-left: 10px; margin-right: 10px; margin-top: 10px; float: right;\">\n<img src='https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Lord_Keynes.jpg/453px-Lord_Keynes.jpg'  alt=\"John Maynard Keynes\"/>\n<div style=\"text-align: center;\">John Maynard Keynes, hero or devil?</div>\n</div>\n<h2>We're all Keynesians now, except for the Austrians</h2>\n<p>According to Saifedean, all of Keynes ideas are fucking garbage and all\nof the theories that developed from them are also fucking garbage. That is\nall of modern economics! What's left? During the 20th century, there was another\ngroup of economists known as the <a href=\"https://en.wikipedia.org/wiki/Austrian_School\">Austrian Schoool</a>\nthat didn't buy into Keynes ideas of stimulating the economy by printing money. The Austrians,\nled by Friedrich Hayek and Ludwig Von Mises among others, focused on building economies on top of sound money,\nthe business cycle theory, and this thing called praxeology (which I don't yet understand). They love gold and\nentrepreneurship. They hate central banks. These guys were on the fringes for the entire 20th century but\nalways had a loyal following among libertarians. As an aside, Austrian economics is <strong>huge</strong> in the Bitcoin\nworld because they see Bitcoin as the Gold Standard for a digital world.</p>\n<p>The Austrians have a very different explanation for the Great Depression, claiming that it started\nwith a credit bubble enabled by the Federal Reserve and was exacerbated by price and wage controls. The Great Depression, they argue, could\nhave been avoided by not allowing the credit bubble to form in the first place and failing that, by relaxing the price and wage controls.</p>\n<p>The Austrians place great importance on\n<em>sound money</em> and provide much of the intellectual inspiration for this book.</p>\n<p>Saifedean loves the Austrians and so does the Bitcoin community by and large. I find the Austrians\ninteresting but it is hard for me to discount all of modern economics. I am not yet convinced\nof the Austrians' ideas. The Austrians' ideas are very closely associated with libertarianism which\nI am not adherent of.</p>\n<h2>Finally Bitcoin</h2>\n<p>Saifedean does a great job explaining Bitcoin and how it could function as a reserve currency. The scalability\nlimits of Bitcoin are a feature not a flaw as Bitcoin could easily handle all interbank settlements. It can't be VISA\nbut we don't need it to be to serve a reserve currency. I strongly agree with him there. He also foresees the\nemergence of Bitcoin banks that hold custody of your Bitcoin and settle with each other. He does not expect the average\nuser to be responsible for the custody of their Bitcoins. I also agree with 100% on that.</p>\n<p>Saifedean also discusses blockchain in the large and alt-coins. He does not\nbelieve that blockchains can be used to represent real world assets such as real\nestate or stock equity. I very much disagree with him there and strongly believe\nthat we will in time represent real world assets on blockchains but it will take a lot\nof technical and legal infrastructure to get there.</p>\n<h2>What I Loved</h2>\n<p>This was a financial history tour de force. While I am still unconvinced of some ideas of Austrian economics I appreciated his explanations of their ideas. His\nargument that Bitcoin will replace the US dollar is <em>very</em> compelling and should be taken seriously.</p>\n<h2>What I Didn't Love</h2>\n<p>An alternate title for this book could be \"Keynes was an Idiot, a Terrible Person, and the World He Made is Trash.\" I appreciate the flaws in Keynesianism, thanks to this book, but Saifedean\ngoes unnecessarily far in criticizing John Maynard Keynes the man. He cites Keynes' poor management of his own money and his work ethic for inspiring Keynes' ideas around how to stimulate an economy. He also spends inordinate time alleging that Keynes was a pedophile. I really don't give a shit about Keynes sexual history. Saifedean's dwelling on Keynes' personal faults is a distraction from his criticism of Keynes' ideas. Should there be a second edition, I recommend cutting out the discussion of Keynes personal faults.</p>\n<p>Similarly, Saifedean spends part of the book discussing the poor quality of\nmodern art and ties it to our modern unsound money and the short-term thinking\nit has fostered. He singles out artists Jackson Pollock and Mark Rothko for\nproducing \"garbage.\" While I am not familiar with Rothko, I really like\nPollock's work. I also enjoy Caravaggio and have seen his work in person at\nVilla Borghese in Rome.  However, I must admit that I quite possibly have bad\ntaste. Saifedean might be right modern art is garbage but his argument here is\nmuch weaker than his others. In my opinion, this portion was also a distraction.</p>\n<h2>Summary</h2>\n<p>I recently read an article in <a href=\"https://www.economist.com/leaders/2018/08/30/bitcoin-and-other-cryptocurrencies-are-useless\">the Economist</a> that made it clear that mainstream economists just don't get it. Don't make the same mistake,\nread the Bitcoin Standard.</p>","id":"0a23631d-6fc9-5b04-b0e9-b6b406f101ee","excerpt":"There is a plethora of blogs, podcasts, books, and Internet flotsam that you can consume to learn about Bitcoin. If you are new to this…","frontmatter":{"path":"/blog/bitcoin-standard","date":"14 September, 2018","title":"Book Review - The Bitcoin Standard by Saifedean Ammous","tags":"blog"}}},{"node":{"html":"<p>Bryan and Miko talk about how banking makes no sense and how Bitcoin might impact the global financial system.</p>\n<iframe style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/6963446/height/90/theme/custom/autoplay/no/autonext/no/thumbnail/yes/preload/no/no_addthis/no/direction/backward/render-playlist/no/custom-color/87A93A/\" height=\"90\" width=\"100%\" scrolling=\"no\"  allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen></iframe>\n<h3>Banking myths</h3>\n<p>Myth number one: Banks lend out depositors' money as loans. <strong>False. Banks lend against depositors money. Each new loan actually creates the money that is loaned with an entry in an electronic ledger.</strong></p>\n<p>Myth number two: Banks have to keep 10% of each one dollar (Reserve Ratio) of\ndeposits and this constrains how many loans the bank can make. Due to the\nreserve ratio, the amount of new money created by bank deposits\ncan be calculated with the Money Multiplier.</p>\n<p><strong>No longer true. See the New York Fed's <a href=\"https://www.newyorkfed.org/research/epr/02v08n1/0205benn/0205benn.html\">article</a> on why reserve requirements are no longer binding</strong></p>\n<p>Myth number 3: national savings == national investment</p>\n<p><strong>Not really. In part because the Leverage Ratio is so large and because market forces\nactually decide where money is invested</strong></p>\n<p>Myth number 4: The U.S. dollar is backed by the gold in Fort Knox.</p>\n<p><strong>Not since 1971 when <a href=\"https://mises.org/wire/today-1971-president-nixon-closes-gold-window\">Nixon closed the Gold Window</a></strong></p>\n<p>Given that we have debunked these myths, we need to answer some glaring questions</p>\n<ol>\n<li>Why do banks take deposits?</li>\n<li>Why do banks pay interest our deposit accounts when they don't actually lend out our money?\n3.. What constrains how much money banks can create?</li>\n<li>Do new loans increase a bank's capital and thus its ability to yet\nmake even more loans?</li>\n<li>How does the Fed keep interest rates low and are there risks to keeping interests rates low? (hint: quantitative easing)</li>\n<li>What happens when I transfer money in my account to another bank? What happens when\nI transfer money from a U.S. bank to one not in the United States?</li>\n</ol>\n<h3>If/when will the U.S. devalue its currency and how?</h3>\n<p>Miko thinks not but this entirely depends on the trade relationship between the U.S. and China.</p>\n<h3>Where do cryptocurrencies fit into this?</h3>\n<p>Many people in the Bitcoin community believe that Bitcoin will eventually supplant the U.S. dollar\nas the world's reserve currency. They think of Bitcoin as <a href=\"https://www.amazon.com/Bitcoin-Standard-Decentralized-Alternative-Central/dp/1119473861\">a better Gold Standard</a></p>\n<h3>Summing up</h3>\n<p>How the banking system actually works defies our intuitions about it. Banking in our modern world really\nis fucking insane.</p>\n<h3>Picks</h3>\n<p>Bryan</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=WQui_3Hpmmc&#x26;list=PL8FB14A2200B87185\">Robert Shiller's lectures on Understanding Financial Markets</a></li>\n<li><a href=\"https://noded.org/\">Noded Bitcoin podcast</a></li>\n<li><a href=\"https://epicenter.tv/\">Epicenter podcast</a></li>\n<li><a href=\"https://www.youtube.com/user/PositiveMoneyUK\">Positive Money series</a></li>\n</ul>","id":"59f892da-09fa-559e-b8d1-6e9bbbf63a10","excerpt":"Bryan and Miko talk about how banking makes no sense and how Bitcoin might impact the global financial system. Banking myths Myth number one…","frontmatter":{"path":"/podcast/banking-is-insane","date":"24 August, 2018","title":"Episode 1 - Banking is Fucking insane","tags":"podcast"}}},{"node":{"html":"<p>Some months ago I decided to reorient my development career from the DevOps space to web\ndevelopment with JavaScript. I at first tried to apply my editor of choice\n(<a href=\"https://www.gnu.org/software/emacs/\">emacs</a>)but was continually frustrated by\nthe mediocre support for working with JavaScript, particularly compared to\nPython. After wasting at least a day trying to get my Emacs config to support basic completion and syntax checking in JavaScript I came across the blog post <a href=\"https://swizec.com/blog/vscode-better-editor-emacs/swizec/7921\">10 Years\nof love for Emacs Undone by one week of\nVSCode</a>. The\ntitle really struck me as I have spent exactly 10 years with Emacs myself. I decided\nto top swimming upstream and jump wholeheartedly into VS Code. It has been a mixed experience.</p>\n<p>I was instantly struck how amazing VS Code's support is for the JavaScript\nlanguage, libraries, and the web environment. Every tutorial on react, Vue.js, Electron, you name it, recommends using VS Code. My VS Code experience became even better when I\nlearned to drop <code>//@ts-check</code> in every file.  VS Code's language support is so\nawesome that I highly doubt any other editor will ever seriously compete with it\nin that regard. At the same time, I hit a pretty significant pain point\ninstantly. I use emacs keybindings everywhere, in the shell, browser, you name\nit. On OS X, <a href=\"https://pqrs.org/osx/karabiner/\">Karabiner</a> mapped those bindings\nfor me and now on linux laptop with GNOME it is a top-level feature. In VS Code\nI found that I was constantly closing the editor accidentally or deleting a\ntext in a buffer with the most common commands that I use thousands of times a\nday. Here are just a few. I probably have >100 in muscle memory.</p>\n<ul>\n<li>M-f forward word</li>\n<li>M-b backward word</li>\n<li>C-w cut text</li>\n<li>M-w copy text</li>\n<li>C-SPACE start a selection</li>\n<li>C-a beginning line</li>\n<li>C-e end of line</li>\n<li>M-a back paragraph</li>\n<li>M-e forward paragraph</li>\n<li>C-s search forward</li>\n<li>C-j Change buffer</li>\n<li>and many more</li>\n</ul>\n<p>I found an <a href=\"https://github.com/SebastianZaha/vscode-emacs-friendly\">emacs plugin for VS Code</a> but it only muddled the situation memory as it only supported some\ncommands and then with annoying bugs that made the plugin more trouble than it was worth.</p>\n<p>I dropped the emacs plugin and tried to do things the VS Code way. It only kind of worked for me but I soon encountered more hurdles. As a developer, there is a whole set of things we do that are project-related tasks such as:</p>\n<ul>\n<li>Working with git</li>\n<li>Renaming files, moving them around</li>\n<li>Maintaining a personal TODO list and logging errors, troubleshooting information in a personal log</li>\n<li>Executing shell commands</li>\n<li>Writing documentation in markdown, ReST, asciidoc</li>\n</ul>\n<p>While VS Code likely has some support for these, I found the VS Code plugins in these areas lacking\nwhen I tried them. For example, I found jumping between projects with <a href=\"https://marketplace.visualstudio.com/items?itemName=alefragnani.project-manager\">Project Manager</a> very poor in comparison to Emacs' incredible <a href=\"https://github.com/bbatsov/projectile\">Projectile</a>. It is important to note that the Project Manager addon may have improved significantly since I last used it a few months ago. The existing git addons also pale in comparison to Emacs' fantastic <a href=\"https://magit.vc/\">git interface</a>. <a href=\"https://github.com/abo-abo/swiper/blob/master/counsel.el#L1222\">counsel-git-grep</a> across a huge codebase truly is a superpower.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/AgRsYOJi6ao\" frameborder=\"0\" allowfullscreen></iframe>\n<p>I am one of those crazy people that runs a terminal inside of emacs. I even have a keybinding (M-j) that\nI use to toggle between character and line mode in the terminal. VS Code's terminal is OK but nothing to write home about.</p>\n<p>I use Emacs <a href=\"https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html\">dired</a> mode for manipulating files and directories. It works ridiculously well.</p>\n<p>More than magit, projectile, dired, I missed emacs' <a href=\"https://oremacs.com/swiper/\">ivy</a> completion framework more than anything else. You really have to see it to believe it.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/VvnJQpTFVDc\" frameborder=\"0\" allowfullscreen></iframe>\n<p>So while I could use VS Code for writing JavaScript, I still found myself spending 30-50% of my work time in Emacs. The mismatch between keybindings in VSCode and rest of my tools just kept tying my fingers in knots.</p>\n<p>So far I have talked a whole lot about the Emacs features that I miss in VS Code. But surely, you ask, won't VS Code implement all of those features even better than Emacs given the VS Code teams extensive developer resources? Maybe, but I would be surprised if they did. I doubt the VS Code team intends to give it a kitchen sink of capabilities that we see in Emacs.</p>\n<p>After one month, I decided to reinvestigate using Emacs for JavaScript. I came upon the awesome <a href=\"https://github.com/ananthakumaran/tide\">Tide-mode</a>. It took me about a day but I got it working to my satisfaction. It does not hold a candle to VS Code but it provides me enough features to be productive in JavaScript.</p>\n<p>Some of the features tide-mode provides:</p>\n<ul>\n<li>auto-completion (via company-mode)</li>\n<li>linting</li>\n<li>syntax-checking (together w/ flycheck)</li>\n<li>documentation at point</li>\n<li>basic refactoring</li>\n</ul>\n<p>Here is tide-mode in action</p>\n<p><img src=\"https://i.imgur.com/jEwgPsd.gif\" alt=\"tide in action\"></p>\n<p>A few notes on using tide-mode:</p>\n<ol>\n<li>You have to drop a jsconfig.json (for JavaScript) or tsconfig.json (for TypeScript) into your project in order to use it.</li>\n<li>You have to install typescript into your projects for it to work optimally. As it leverages the <code>tsserver</code> that ships with TypeScript. Note that it does not need to be a project dependency. You can install it thus with <code>npm install typescript</code></li>\n<li>I am using Emacs 26. Not sure how well this works with Emacs 25</li>\n<li>I haven't found a good way to fully support JSX in files with a regular <code>.js</code> extension. So far I have simply renamed any file containing JSX to <code>.jsx</code> in order to get web-mode + tide-mode to work properly.</li>\n</ol>\n<p>I may be mistaken but I believe the <code>tsserver</code> that ships with TypeScript was developed by the same team that makes VS Code. It is not without irony that the Emacs mode I am using to replace of VS Code depends on software developed by the VS Code team.</p>\n<p>VS Code is an excellent IDE and I would recommend any new software developer to use it. But with the excellent tide-mode, I no longer need to.</p>\n<p>You can find my emacs configuration for JavaScript <a href=\"https://github.com/bryanwb/dotfiles/blob/master/emacs.d/init.el#L845-L909\">here</a>.</p>\n<p>P.S. I haven't figured out a great solutions for the following and would love to hear from you the readers.</p>\n<ul>\n<li>Debugging - I still use VS Code but have looked into <a href=\"https://github.com/GoogleChromeLabs/ndb\">ndb</a>. Don't know yet if it is a worthy replacement.</li>\n<li>HTML element, css attribute completion - One of my favorite things about VS Code is that it supports completion and inline documentation for CSS and HTML, technologies that I know pathetically little about.</li>\n<li>Browsing Mozilla, CSS documentation within Emacs - anyone have a good solution for this? iirc helm-dash has something useful here but I haven's seriously investigated it.</li>\n<li>Auto-completion, linting for Flow - I don't use flow so I have been able to skip this so far but I very much would like to browse and contribute to the desktop application for <a href=\"https://ledger.fr\">Ledger</a> and it uses Flow extensively.</li>\n</ul>\n<p>P.P.S. Thanks so much to <a href=\"https://ananthakumaran.in/\">Anantha Kumaran</a> for his work on tide-mode w/out which I would be stuck in VS Code.</p>\n<p>Update: below is the magic incantation that I used in my web-mode configuration to get jsx syntax highlighting in regular <code>.js</code> files</p>\n<pre><code class=\"language-lisp\">    (setq web-mode-content-types-alist\n          '((\"jsx\" . \"\\\\.js[x]?\\\\'\")))\n</code></pre>","id":"11bb0886-79c0-52c2-85f1-9dee15d91acd","excerpt":"Some months ago I decided to reorient my development career from the DevOps space to web\ndevelopment with JavaScript. I at first tried to…","frontmatter":{"path":"/blog/goodbye-vscode","date":"23 August, 2018","title":"Goodbye VSCode, Hello Emacs (Again)","tags":"blog"}}}]}},"pageContext":{}}