{"data":{"markdownRemark":{"html":"<p>Bryan and Miko talk about banking makes no sense and how Bitcoin comes into the picture.</p>\n<iframe style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/6963446/height/90/theme/custom/autoplay/no/autonext/no/thumbnail/yes/preload/no/no_addthis/no/direction/backward/render-playlist/no/custom-color/87A93A/\" height=\"90\" width=\"100%\" scrolling=\"no\"  allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen></iframe>\n## Intro\n<ul>\n<li>Why are we here? Why is this show called Hot Air? Where are we?</li>\n<li>Introduce Miko</li>\n<li>Investment disclaimer</li>\n<li>Purpose of this show - discuss some of the commonly held myths\nabout banking and how they relate to discussions about cryptocurrencies</li>\n</ul>\n<h3>Banking myths</h3>\n<p>Myth number one: Banks lend out depositors' money as loans.</p>\n<p>Myth number two: Banks have to keep 10% of each one dollar (Reserve Ratio) of\ndeposits and this constrains how many loans the bank can make. Due to the\nreserve ratio, the amount of new money created by bank deposits\ncan be calculated with the Money Multiplier.</p>\n<p>Myth number 3: national savings == national investment</p>\n<p>Myth number 4: The U.S. dollar is backed by the gold in Fort Knox.</p>\n<p>Given that we have debunked these myths, we need to answer some glaring questions</p>\n<ol>\n<li>Why do banks take deposits?</li>\n<li>Why do banks pay interest our deposit accounts when they don't actually lend out our money?\n3.. What constrains how much money banks can create?</li>\n<li>Do new loans increase a bank's capital and thus its ability to yet\nmake even more loans?</li>\n<li>How does the Fed keep interest rates low and are there risks to keeping interests rates low? (hint: quantitative easing)</li>\n<li>What happens when I transfer money in my account to another bank? What happens when\nI transfer money from a U.S. bank to one not in the United States?</li>\n</ol>\n<p>Are we currently in a bubble and if so, what is fueling it?</p>\n<p>Weird shit happening due to abnormally low interest rates:</p>\n<ol>\n<li>companies borrowing to buy back own shares</li>\n<li>asset price bubble</li>\n</ol>\n<p>How sensitive are student loans to changes in the interest rate?</p>\n<h3>If/when will the U.S. devalue its currency and how?</h3>\n<ul>\n<li>Massive state debt defaults over pension programs</li>\n<li>Massive student loan defaults</li>\n</ul>\n<h3>Where do cryptocurrencies fit into this?</h3>\n<p>First, some history on the gold standard.</p>\n<p>Could Bitcoin or Ethereum replace the Gold Standard?</p>\n<p>Why does the Bitcoin community love the Austrian economists and focus\nso much on monetary policy?</p>\n<p>How could Bitcoin replace Gold when mining is centralized in some regards? Specifically, something like 90% of miners are in China.</p>\n<p>Who are the Austrian economists and are they sane?</p>\n<h3>Could Bitcoin replace the dollar as the world's reserve currency?</h3>\n<p>and what would that look like?</p>\n<p>How banks make loans in a Bitcoin world?</p>\n<h3>Contrarian View - What if Trump pulls off MAGA?</h3>\n<p>What if he succeeds wildly despite his utter lack of competence? What\nwould that look like? What if China suffers some major blows and the dollar gets so strong we can print money to get out of all your debt problems w/out causing\ninflation?</p>\n<h3>Summing up</h3>\n<p>How the banking system actually works defies our intuitions about it. Banking in our modern world really\nis fucking insane.</p>\n<h3>Legit or Quit</h3>\n<ol>\n<li>Fractional Reserve Banking</li>\n<li>Bitcoin</li>\n<li>Ethereum</li>\n<li>Investing in Gold</li>\n<li>Tesla</li>\n</ol>\n<h3>Picks</h3>\n<p>Bryan</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=WQui_3Hpmmc&#x26;list=PL8FB14A2200B87185\">Robert Shiller's lectures on Understanding Financial Markets</a></li>\n<li><a href=\"https://noded.org/\">Noded Bitcoin podcast</a></li>\n<li><a href=\"https://epicenter.tv/\">Epicenter podcast</a></li>\n<li><a href=\"https://www.youtube.com/user/PositiveMoneyUK\">Positive Money series</a></li>\n</ul>\n<p>Miko?</p>","frontmatter":{"date":"August 24, 2018","path":"/podcast/banking-is-insane","title":"Episode 1 - Banking is Fucking insane","tags":"podcast"}}},"pageContext":{}}