{"data":{"markdownRemark":{"html":"<p>Bryan talks with Stephan Livera about Bitcoin, banking, and Austrian economics.</p>\n<p>The below is just a placeholder:</p>\n<iframe style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/6963446/height/90/theme/custom/autoplay/no/autonext/no/thumbnail/yes/preload/no/no_addthis/no/direction/backward/render-playlist/no/custom-color/87A93A/\" height=\"90\" width=\"100%\" scrolling=\"no\"  allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen></iframe>\n<h3>Intro</h3>\n<p>How did Stephan get interested in this space? What's his day job?</p>\n<h3>Those darn austrians</h3>\n<p>In the world of Bitcoin, libertarians have been very influential and they keep referring to Austrian economics. As I understand it, Austrian economics rejects our the current status quo of mainstream\neconomics. In fact it is so different, it is hard to take them seriously initially. In the Money and Banking course I took at university I never heard about Austrian economics.</p>\n<ul>\n<li>At the 10,000 foot level, what is Austrian economics?</li>\n<li>Do you believe in Praxeology? and do you reject empiricism in economics and econometrics?</li>\n<li>If I look at this week's issue of the Economist, will I find any articles written by Austrians or espousing their ideas?</li>\n<li>What is the difference between Keynesianism and Austrian economics?</li>\n<li>How do Austrians explain the cause for America's Great Depression and what solution did they recommend?</li>\n<li>We know the Keynesianism mechanism to stimulate the national economy but what do Austrians recommend to stimulate the national economy?</li>\n<li>What resources/books would you recommend to learn more?</li>\n<li>Austrians are very much associated with the libertarian political movement (ahem, Rothbard)? Why should non-libertarians study them?</li>\n</ul>\n<h3>Talkin' 'Bout banking</h3>\n<ul>\n<li>Does Stephan understand Basel III?</li>\n<li>What limits a bank's ability to make new loans?</li>\n<li>The Money Multiplier is a myth, correct?</li>\n<li>When a bank makes a loan, does it increase its capital base such that it can then make even greater loans?</li>\n<li>We've established how banks create money, but what is the process by which banks destroy money?</li>\n<li>What's your opinion of fractional reserve banking?</li>\n</ul>\n<h3>Bitcoin and its implications</h3>\n<p>Let's say that Bitcoin becomes the global reserve currency</p>\n<ul>\n<li>What would banking look like? How would Bitcoin banks work?</li>\n<li>Would interest rates be much higher? and if so would that be a bad thing?</li>\n<li>Might there be both Custodial banks and banks that lend out your Bitcoin?</li>\n<li>How would a global Bitcoin standard affect the modern welfare state? Would it mean the end of the NHS in Britain or other aspects of the modern social safety net?</li>\n<li>Do you see KYC coming to Bitcoin in some manner? (I assume not) and if not how will governments collect taxes and thus fund the social safety net?</li>\n</ul>\n<h3>Devil's Advocate</h3>\n<p>What could derail Bitcoin for the next 5-10 years? What if the dollar continues to appreciate, the Yuan goes to shit in a Chinese recession, and we see a strong dollar for the next 10 years. Would that slow the growth of Bitcoin?</p>\n<h3>Legit or Quit</h3>\n<ol>\n<li>Fractional Reserve Banking</li>\n<li>Ethereum</li>\n<li>The Free Banking movement led by Larry White and George Selgin</li>\n<li>Murray Rothbard</li>\n</ol>","frontmatter":{"date":"October 01, 2018","path":"/podcast/stephan-livera-explains-it-all","title":"Episode 2 - Stephan Livera","tags":"podcast draft"}}},"pageContext":{}}