{"data":{"markdownRemark":{"html":"<p>Bryan talks with <a href=\"https://twitter.com/\">Rich Brown</a> about <a href=\"https://makerdao.com\">MakerDAO</a>.</p>\n<h2>Questions</h2>\n<h3>makerdao the company</h3>\n<ul>\n<li>What is your background? How did you get into this space?</li>\n<li>What is your role w/ MakerDAO?</li>\n<li>About MakerDAO the company. Where is it headquartered?</li>\n<li>How is MakerDAO funded (VC) and does it currently have any substantial revenue streams? (sale of MKR for stability fees?)</li>\n<li>What would happen to DAI if the US regulators wanted to shutdown the Makerdao organization headquartered in the U.S.? Would MakerDAO shut down entirely or continue operating in other countries?</li>\n</ul>\n<h3>finance stuff</h3>\n<ul>\n<li>Rune said on chat that a large portion of the USD money supply is government debt. how does that work? don't bonds reduce the total supply?</li>\n</ul>\n<h3>the mechanism</h3>\n<ul>\n<li>Walk through the CDP creation process at very rapid speed before asking lots of niggling questions.</li>\n<li>What is wrapped ETH? PETH? Why are these things necessary? (I know why but let's get into it)</li>\n<li>TODO - Question about PETH dilution - i don't understand it.</li>\n<li>Since every DAI is backed by 150% collateral, can I exchange my DAI for 100% its value in collateral? Like one might have w/ a gold certificate? (I know why you can't but lets get into this).</li>\n<li>If DAI is below $1, say at $ 0.90, what mechanisms are there to bring it back to $1?</li>\n<li>Why would someone create DAI w/ a CDP if they were bearish on the ETH price in the short-term, say next 6 months?</li>\n<li>How does the arbitrage keeper work? </li>\n<li>How will the auction keeper work?</li>\n<li>I have heard on chat that the Target Rate Feedback Mechanism is deprecated. What will replace it?</li>\n<li>Hasufly argued in a great blog post that DAI does not scale to match demand as the creation of CDPs depends on how bullish ETH holders are not the actual demand for DAI. Rune responded that this is incorrect and that creation of CDPs actually does follow the demand for DAI. Unfortunately, I didn't understand his response! Can you break it down?</li>\n<li>Would DAI still be compelling if it required KYC?</li>\n<li>What is a \"boom\" and a \"bust\"?</li>\n</ul>\n<h3>multi-collateral DAI</h3>\n<ul>\n<li>Will you consider any collateral that requires KYC?</li>\n</ul>\n<h3>meta</h3>\n<ul>\n<li>Disruptive innovations often have to become \"useful\" to society at large before the very organizations/structures they disrupt can move against them. How might DAI become \"useful\" to society at large?</li>\n<li>Many prominent projects in the crypto space are vocal libertarians and anarcho-capitalists, see Voorhees, Roger Ver, and Vitalik to some extent. While DAI is potentially very disruptive to many aspects of the financial world I have never heard a peep from Rune or others at maker about Libertarianism, Mises, Rothbard, etc. Are you guys just trying not to be confrontational--which is smart--or <em>gasp</em> are you a bunch of centrist liberals who aren't looking to destroy central banking but rather take some of its better ideas into a digital, borderless world?</li>\n</ul>\n<h3>burnin' up w/ xDAI</h3>\n<ul>\n<li>I am so excited about the burner wallet, have you used it?</li>\n<li>One use case that I really like is what i call the reverse ATM. You put fiat cash in a machine and it transfers the fiat to your cash card, typically special purpose for a public transportation system. It is called a Rabbit card here in Bangkok, Octopus card in Hong Kong. It would be incredible to put fiat into a DAI reverse ATM and then be able to transfer it to your burner. This would in effect, be a universal cash card. What needs to happen for this become a reality? Is it impossible?</li>\n<li>How familiar are you w/ the POA networks xDAI chain? Do you see any issues w/ relying on a somewhat proprietary and definitely centralized network for common transactions?</li>\n</ul>\n<h3>finance</h3>\n<ul>\n<li>Could DAI extend the dominance of the USD as the world's reserve currency?</li>\n<li>Are there any scenarios where DAI might serve a \"useful\" function for the Federal Reserve and USD? Rune suggested on chat that if DAI were very successful it might help keep down the rate that US treasury bonds provide.</li>\n<li>what is a trading pair?</li>\n<li>What is a liquidity provider?</li>\n<li>Which resources did you use to learn about finance? About Ethereum?</li>\n<li>Why isn't DAI on more exchanges?</li>\n<li>What use cases for DAI most excite you?</li>\n</ul>","frontmatter":{"date":"January 27, 2019","path":"/podcast/makerdao-with-rich-brown","title":"Episode 4 - Getting into the specifics of MakerDAO with Rich Brown","tags":"podcast, draft"}}},"pageContext":{}}