{"data":{"markdownRemark":{"html":"<p>Some months ago I decided to reorient my development career around web\ndevelopment with JavaScript. I at first tried to use my editor of choice\n<a href=\"https://www.gnu.org/software/emacs/\">emacs</a> but was continually frustrated by\nthe mediocre support for working JavaScript, particularly compared to\nPython. After wasting at least a day trying to get my Emacs config to support\nJavaScript as well as I had it for Python I came across the blog post <a href=\"https://swizec.com/blog/vscode-better-editor-emacs/swizec/7921\">10 Years\nof love for Emacs Undone by one week of\nVSCode</a>. The\ntitle really struck me as I have spent exactly 10 years with Emacs myself. I decided\nto top swimming upstream and jump wholeheartedly into VS Code. It was a mixed experience.</p>\n<p>I was instantly struck how superior VS Code's support is for the JavaScript language, libraries,\nand the web environment. It got significantly better when I learned to drop <code>//@ts-check</code> in every file.\nVS Code's language support is so awesome that I highly doubt any other editor will ever seriously compete with it in that regard. At the same time, I hit a pretty significant pain point. I use emacs keybindings everywhere, in the shell, browser, you name it. On OS X, <a href=\"https://pqrs.org/osx/karabiner/\">Karabiner</a> mapped those bindings for me and now on linux laptop with GNOME its a top-level feature. In VS Code I foudnd that I was constantly breaking the editor with the most common commands that I use thousands of times a day. Here are just a few. I probably have ~100 in muscle memory.</p>\n<ul>\n<li>M-f forward word</li>\n<li>M-b backward word</li>\n<li>C-w cut text</li>\n<li>M-w copy text</li>\n<li>C-SPACE start a selection</li>\n<li>C-a beginning line</li>\n<li>C-e end of line</li>\n<li>M-a back paragraph</li>\n<li>M-e forward paragraph</li>\n<li>C-s search forward</li>\n<li>C-j Change buffer</li>\n<li>etc.</li>\n</ul>\n<p>I found an <a href=\"https://github.com/SebastianZaha/vscode-emacs-friendly\">emacs plugin for VS Code</a> but it only confused my muscle memory as it only supported some\ncommands and then with small annoying bugs that made the plugin more trouble than it was worth.</p>\n<p>I dropped the emacs plugin and tried to do things the VS Code way. It only kind of worked for me. As a developer, there is a whole set of things we do that are code-related but not coding per se, here are just a few:</p>\n<ul>\n<li>Working with git</li>\n<li>Managing files</li>\n<li>Maintaining a personal TODO list and logging errors, troubleshooting information</li>\n<li>Executing shell commands</li>\n<li>Writing documentation</li>\n</ul>\n<p>While VS Code likely has some support for these, I found the VS Code plugins in these areas lacking\nwhen I tried them. For example, I found jumping between projects with <a href=\"https://marketplace.visualstudio.com/items?itemName=alefragnani.project-manager\">Project Manager</a> very lacking in comparison to Emacs' incredible <a href=\"https://github.com/bbatsov/projectile\">Projectile</a>. It is important to note that the Project Manager addon may have improved significantly since I last used it. The existing git addons also pale in comparison to Emacs' fantastic <a href=\"https://magit.vc/\">git interface</a>.</p>\n<p>I am one of those crazy people that runs a terminal inside of emacs. I even have a keybinding (M-j) that\nI use to toggle between character and line mode in the terminal. VS Code's terminal is OK but nothing to write home about.</p>\n<p>I use Emacs <a href=\"https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html\">dired</a> mode for manipulating files and directories. It works ridiculously well.</p>\n<p>More than magit, projectile, dired, I missed emacs' <a href=\"https://oremacs.com/swiper/\">ivy</a> completion framework more than anything else. You really have to see it to believe it.</p>\n<p><a href=\"https://www.youtube.com/watch?v=VvnJQpTFVDc\" title=\"Ivy in Action\"><img src=\"http://img.youtube.com/vi/VvnJQpTFVDc/0.jpg\" alt=\"Ivy in Action\"></a></p>\n<p>So far I have talked a whole lot about the Emacs features that I miss in VS Code. But surely, you ask, won't VS Code implement all of those features even better than Emacs given the VS Code teams extensive developer resources? Maybe, but I would be surprised if they did. I doubt the VS Code team intends to give it a kitchen sink of capabilities. Emacs' kitchen sink approach made it unbearably slow some decades ago. Luckily, it is ridiculously fast by today's standards since it is written in C. VS Code, written primarily in JavaScript, will bog down if they flesh it out with the capabilities I have described here.</p>","frontmatter":{"date":"August 23, 2018","path":"/blog/goodbye-vscode","title":"Goodbye VSCode, Hello Emacs (Again)","tags":"blog"}}},"pageContext":{}}