{"data":{"markdownRemark":{"html":"<p>After 10 years working as a professional software engineer, I enrolled in\nGeorgia Tech's <a href=\"www.omscs.gatech.edu/\">Online Master's in Computer Science</a>. I was motivated by the large\ngaps in my knowledge that I was not able to fill by self study despite numerous\nattempts. While I earned an undergrad degree in Computer Science, I have never\nwritten a compiler, dug in depth into operating systems concepts, gone beyond\nintro to algorithms, or delved into AI/ML/RL at all. A CS grad from MIT very\nwell graduates with all those skills but I went to a middling university and got\nwell, middling grades. After 10 years in the field I am a Hell of a lot more\nmotivated and also much more genuinely interested in the subject than I was at\nage 20 when I just enrolled into intro to CS because I couldn't get into an\nEconometrics class.</p>\n<p>I am four classes into OMSCS program and I have to tell you that on the whole it\nis fucking amazing. The classes are hard, my classmates are super engaged and\nhelpful, and I am learning a lot. Did I mention that the program is cheap? Only\n$180/credit hour which adds up to only $8,000 USD for the entire degree. That\nlow price means that the OMSCS can attract very smart people from all over the\nworld who can't take out student loans or don't have the means to drop $21K on a\ngraduate degree. That low price also means that Georgia Tech is serious about\nattracting the best students not just those that can pay.</p>\n<p>I am surprised that the OMSCS program 1) doesn't get more attention and 2) isn't\ncopied by more institutions. Let me clarify by what I mean by \"not more\npopular.\" On Hacker News and other programming-related outlets there are\nconstantly posts on how to become a software engineer or how become a better\nsoftware engineer and the OMSCS program only comes up in the discussion\noccasionally. Further, most of the software engineers I meet in person aren't\naware of the program's existence. I suspect that the program doesn't get more\nattention because it is really damn hard and most aspirants to a software\nengineering career are looking for an easier way into the field than a 3 year\nlong 20 hour a week slog. If you're lucky like me and can do the program\nfull-time, you're looking at 40+ hrs/week for 2 years. Fuck that, just spend\n$15k on a six month programming bootcamp and I am sure you will get that FAANG\njob of your dreams!  Sorry friends, it doesn't work that way.</p>\n<p>It is worth mentioning that there are broadly two groups of students I have met\nin the program. The first group are those that are looking to generally upgrade\ntheir skills. These people often but not always choose the Computing Systems\nspecialization. This group doesn't have to get this degree to make the next\ncareer step. The second group are those that are here for AI/ML. These people\nare very smart, dedicated, and generally need this degree to get a job in the\nAI/ML field. Most undergrad programs don't offer AI/ML so this often a student's\nfirst academic exposure to the topic.</p>\n<p>I will break down my experience so far into the proverbial good, bad, and ugly. </p>\n<h2>The Good</h2>\n<ul>\n<li>My classmates are dedicated, smart, and genuinely interested in the topic. In\none course, I learned a signicant amount about the topic from a classmate who\nis a hardware engineer with direct experience in areas related to the course\nwe were taking together.</li>\n<li>Many classes are taught by dedicated professors and TAs who pay close\nattention to your experience and provide useful and quick feedback.</li>\n<li>Some courses have amazing lectures and engaging projects.</li>\n<li>More courses are steadily being added. Starting next term we will be able to\ntake data science courses such as Bayesian Statistics and Time Series Analysis\nas electives. A course in Applied Cryptography should become available some\ntime in 2020.</li>\n<li>The class discussions we have on Slack are awesome. Further, the community is\nvery supportive. Some of my classes have alumni channels that are very active\nand keep people connected.</li>\n</ul>\n<h2>The Bad</h2>\n<ul>\n<li>The content of some courses is out of date and in need of a reboot.</li>\n<li>Some courses limp along on a skeleton crew of TAs and the professor responsible\nthe course is only minimally involved.</li>\n<li>Dealing w/ the Georgia Tech bureaucracy can be time-consuming. I typically\nonly have to deal with the bureaucracy during registration thankfully.</li>\n<li>The application process was time-consuming BUT I they did let me in and they\ndidn't require me to take the GRE.</li>\n<li>No distributed system course is offered nor is there a plan to offer one. This\nis a big deal for me personally as it is my professional area of interest.</li>\n</ul>\n<h2>Ugly</h2>\n<ul>\n<li>There are some courses of low quality and poor execution. Rather than call\nthem out, I direct you to look at the course reviews at\n<a href=\"https://omscentral.com/courses\">omscentral.com</a>.</li>\n<li>I doubt that prospective employers will be overly impressed by this\ndegree. They seem to only care about LEETCODE algorithm questions. To pass\nthose interviews you might be better off spending a year on codewars. If you\naren't interested to acquire the knowledge that this program offers, you are\nwasting your time and money.</li>\n</ul>\n<h2>Courses I have taken:</h2>\n<ul>\n<li>High Performance Computer Architecture (HPCA) - This class started where the\nComputer Architecture class I took in undergrad left off. Professor wasn't\nespecially active but his lectures were awesome and the exams were challenging\nin the best possible way. I got an intuitive sense of how Cache Coherence, CPU\npipelining, Tomasulo's Algorithm, etc. work. Our tireless TA, Nolan, did a\ngreat job.</li>\n<li>Graduate Introduction to Operating Systems (GIOS) - Super-involved professor, amazing TAs, best run\ncourse I have taken. I dug into GLibc and kernel source code and up to my neck into how KVM works.\nFor the first time in my life, I started feeling comfortable working in C code.</li>\n<li>Machine Language for Trading (ML4T) - A class w/ great lectures and great\nTAs. The originating professor has moved on some years ago to Morgan Stanley\nand likely a much higher salary. I learned equal parts about finance and the\nbasics of data science. It was a gentle and enjoyable introduction to Machine\nLearning.</li>\n<li>Advanced Operating Systems (AOS) - This class is amazing and hard as fuck. I\nspend 20-30 hours a week on it. I am still in the middle of it. GIOS helped me understand Linux but AOS has taken me way past it to get a grip on microkernels, exokernel, lightweight RPC, and more. Just the other day Google put out a paper on its <a href=\"https://ai.google/research/pubs/pub48630/\">Snap framework</a> and its citations read like AOS's reading list. Just half of AOS prepared me well for understanding Snap and the challenges it is trying to address. The exams in this class are ridiculously difficult.</li>\n</ul>\n<p>Next term I plan on taking Compilers and a data science course.</p>\n<p>As I noted in the introduction, I am surprised by how little competition the\nOMSCS has attracted. Here are some notes on the programs that I considered\nbefore settling on the OMSCS. I do find it unfortunate that while some other\nprestigious institutions offer online MS in CS, they generally do not compare in\nterms of breadth nor cost.</p>\n<p>University of Illinois started an online MS in CS in 2019. U of I charges shocking $670/credit hour thus a <a href=\"https://cs.illinois.edu/academics/graduate/professional-mcs-program/online-master-computer-science#TuitionFees\">whopping total of $21,000</a> for their M.S degree. in C.S. when they do not even offer critical courses such as AI, ML, compilers, Graduate Algorithms, etc. That $21k price tag tells me they are treating the program as a cash cow, not as a real opportunity to reach out to a large swath of students.</p>\n<p>I have heard good things about <a href=\"https://www.cs.utexas.edu/graduate-program/masters-program/online-option#academics\">U Texas MS in C.S.</a>, specifically that they are serious about AI education. Unlike Georgia Tech, Texas offers a Deep Learning course. Further, Texas only charges $333 per credit hour. That's almost double what Georgia Tech charges ($180/credit hour) but still reasonable. Sadly, Texas only currently offers four courses per term. Texas just started this program in 2019 so it will take some time to mature. Here is to hoping they provide Georgia Tech with some much needed competition.</p>\n<p><a href=\"https://asuonline.asu.edu/online-degree-programs/graduate/computer-science-mcs/\">Arizona State</a> offers an impressive set of courses but I have no information on their quality. At $500/credit hour it is a good bit pricier than Georgia Tech or Texas but not as exorbitant as University of Illinois. My personal suspicion is that any university that charges significantly more than Georgia Tech is seeking students who just want the credential at minimal effort. That said, your diploma from Arizona State or University of Illinois will not specify that you earned your M.S. in Computer Science remotely. Like Texas and Illinois, Arizona State's Master's in C.S. started very recently so it has some growing to do.</p>\n<h2>Conclusion</h2>\n<p>I have really enjoyed the OMSCS thus far and if you are willing to put in the work, you will too.</p>","frontmatter":{"date":"October 29, 2019","path":"/blog/y-u-no-omscs","title":"Why Isn't Georgia Tech's Online MS in Computer Science More Popular?","tags":"blog"}}},"pageContext":{}}